# -*- coding: utf-8 -*-

OPERATORS = (
    (u">",u"Больше"),
    (u"<",u"Меньше"),
    (u">=",u"Больше либо равно"),
    (u"<=",u"Меньше либо равно"),
    (u"=",u"Равно"),
)

FACTOR_FIELDS = (
    (u"gender",u"Пол"),
    (u"full_age",u"Возраст"),
)

VALUE_TYPES = (
    (u"i",u"Целое число",int),
    (u"f",u"Дробное",float),
    (u"b",u"Логическое",bool),
    (u"u",u"Текстовое",unicode),
)

RESULTS = (
    (u"о",u"Обнаружено"),
    (u"н",u"Не обнаружено"),
    (u"т",u"Отсутствует"),
)

TEST_FORM = (
    (u"кач.",u"Качественный"),
    (u"п/кол.",u"Полуколичественный"),
    (u"кол.",u"Количественный"),
)